app/Controllers/EvenementController.php

SELECT *
FROM `evenements`
---
    public function afficherListeEvenement()
    {
        $evenementModel = new \App\Models\EvenementModel();
        $listeEvenements = $evenementModel->findAll();