app/Models/BilletModel.php

    public function addBillet(array $data)
    {
        if ($this->insert($data)) {
---
INSERT INTO `billets` (`prix`, `description`, `date`, `lieu`, `categories`) VALUES ('30000', 'Wil', '2025-09-19', 'Analamahitsy', 'BUffet')