app/Models/EvenementModel.php

    public function ajouterEvenement(array $data)
    {
        if ($this->insert($data)) {
---
INSERT INTO `evenements` (`titre`, `description`, `date`, `lieu`, `categorie`, `image`, `places`) VALUES ('Mahaleho', 'Mahaleo est de retour ', '2025-09-19', 'Mahamasina', 'cabaret', '521126196_1258519848553671_7199284978432400608_n.jpg', '97')